9/data/attachments/fc9c2ed8bd866afd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_0fd1a867-3ee0-4023-b238-56d034f09df9</nif:username>
            <nif:friendToBeAdded>Amanda_special_Friend_61587_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>